Desafio Clase 40/Tests/artillery_sin.txt
Phase started: unnamed (index: 0, duration: 1s) 19:50:24(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 19:50:25(-0300)

--------------------------------------
Metrics for period to: 19:50:30(-0300) (width: 4.883s)
--------------------------------------

http.codes.500: ................................................................ 197
http.request_rate: ............................................................. 45/sec
http.requests: ................................................................. 217
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 1108
  median: ...................................................................... 572.6
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1107.9
http.responses: ................................................................ 197
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 19:50:40(-0300) (width: 9.377s)
--------------------------------------

http.codes.500: ................................................................ 456
http.request_rate: ............................................................. 51/sec
http.requests: ................................................................. 477
http.response_time:
  min: ......................................................................... 122
  max: ......................................................................... 1012
  median: ...................................................................... 742.6
  p95: ......................................................................... 963.1
  p99: ......................................................................... 1002.4
http.responses: ................................................................ 456


--------------------------------------
Metrics for period to: 19:50:50(-0300) (width: 6.224s)
--------------------------------------

http.codes.500: ................................................................ 347
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 306
http.response_time:
  min: ......................................................................... 36
  max: ......................................................................... 1004
  median: ...................................................................... 907
  p95: ......................................................................... 963.1
  p99: ......................................................................... 982.6
http.responses: ................................................................ 347
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 19754.5
  max: ......................................................................... 21199.7
  median: ...................................................................... 20543.1
  p95: ......................................................................... 20958.1
  p99: ......................................................................... 20958.1


All VUs finished. Total time: 23 seconds

--------------------------------
Summary report @ 19:50:47(-0300)
--------------------------------

http.codes.500: ................................................................ 1000
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 1108
  median: ...................................................................... 757.6
  p95: ......................................................................... 963.1
  p99: ......................................................................... 1085.9
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 19754.5
  max: ......................................................................... 21199.7
  median: ...................................................................... 20543.1
  p95: ......................................................................... 20958.1
  p99: ......................................................................... 20958.1